# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'the_silver_searcher'

# Development
brew 'mysql'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
#cask 'java'
cask 'mysqlworkbench'
cask 'now'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zoomus'
cask 'emacs'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Giphy Capture', id: 668208984
mas 'Paw', id: 584653203
mas 'Unsplash Wallpapers', id: 1284863847
